{
  "with_onboarding": {
    "user": {
      "name": "Shaifali Gupta",
      "role": "Data Analyst",
      "years_experience": 3,
      "preferred_cities": ["Remote"],
      "avatar_url": null
    },
    "sources": {
      "from_parsed_resume": true,
      "from_onboarding_answers": true
    },
    "persona_text": "Shaifali thrives in high-context product pods where data storytelling nudges roadmaps forward without slowing experimentation. In her last two roles she owned end-to-end analytics for new feature launches, pairing structured SQL diligence with upbeat async rituals that keep product, design, and GTM partners on the same narrative. She gravitates toward ambiguous backlogs, quickly mapping data debt, standing up clean tracking layers, and then using dashboards to spotlight the two or three inflection points that unlock momentum. Teammates count on her calm, slightly wry facilitation style to translate conflicting asks into measurable bets, and leadership taps her to forecast the revenue ripple effects of each sprint. She is energized by remote-first squads that celebrate documentation, celebrate autonomy, and lean on curiosity over hierarchy. In a sprint-ready environment, expect Shaifali to pair thoughtfully with PMs to pressure-test hypotheses, build just-enough instrumentation, and surface insights that keep the wider workspace unblocked.",
    "first_time_after_onboarding": true
  },
  "resume_only": {
    "user": {
      "name": "Shaifali Gupta",
      "role": "Data Analyst",
      "years_experience": 3,
      "preferred_cities": ["Remote"],
      "avatar_url": null
    },
    "sources": {
      "from_parsed_resume": true,
      "from_onboarding_answers": false
    },
    "persona_text": "Shaifali Gupta is a data analyst with three years of experience translating messy product telemetry into the crisp narratives busy PMs need. Her resume highlights a steady pattern: she joins lean SaaS teams, stabilizes their dashboards, then builds reusable experimentation views that help engineers and revenue partners triage priorities. She codes primarily in SQL and Python, and documents in language that makes findings approachable to stakeholders who only see the slides minutes before a meeting. Managers praise her for being thoughtful about data quality trade-offs, asking for just enough time to validate assumptions without becoming a blocker. She is happiest in remote-first pods that value clarity, respectful async communication, and documented decisions. Without onboarding answers yet, this snapshot centers on verifiable achievements: query optimization to reduce runtime by 40%, adoption dashboards for a usage-based feature, and leadership of weekly insights standups. Expect her to focus on signal-to-noise discipline until deeper motivations are captured.",
    "first_time_after_onboarding": false
  }
}
